<hr>

# **RELACIONES ENTRE TABLAS**

<HR>

Hay tres tipos de relaciones:

- uno a uno (one-to-one)
- uno a muchos (one-to-many)
- muchos a muchos (many-to-many)

En una relación uno a uno, cada fila en una tabla está conectada con una y solo una fila de la otra tabla. Es como si una tabla estuviera dividida en dos.

En una relación uno a muchos, cada fila de una tabla coincide con varias filas de otra tabla.

Este es el tipo de relación que vemos con los libros y los autores. Un autor puede escribir varios libros pero cada libro tiene un solo autor.

Pero a veces los libros están escritos por más de un autor (por ejemplo, Neil Gaiman y Terry Pratchett). En estos casos, hablamos de relación muchos a muchos.

En una relación muchos a muchos, varias filas de una tabla coinciden con varias filas de otra tabla. Este tipo de relación produce una tabla de vinculación que combina las claves primarias de ambas tablas.

<hr>

## Diagrama ER

Se puede mostrar la estructura de las bases de datos con diagramas ER (entidad-relación).  Los diagramas muestran tablas y las relaciones entre ellas.

**Relaciones en diagramas ER**

Los diagramas ER también muestran relaciones. El final de la línea que conecta dos tablas indica si uno o varios valores de una tabla coinciden con los valores de la otra.

<hr>

## Buscar Valores Vacíos

En SQL, decimos que las celdas vacías son NULL. Se buscan con el operador IS NULL:

```

SELECT
    *
FROM
    table_name
WHERE
    column_name IS NULL;
```

A veces, en lugar de imprimir filas con valores NULL, queremos excluirlos del resultado.

En estos casos se utiliza el operador NOT:

```
SELECT
    *
FROM
    table_name
WHERE
    column_name IS NOT NULL;
```

Eliminar simplemente las filas NULL no siempre es la mejor opción. A veces querremos reemplazarlas con un cierto valor (digamos, la media) y podemos hacer que esto suceda en la consulta en sí. Para eso tenemos el operador CASE ("en casos cuando"). Es como  if-elif-else en Python:

```
CASE WHEN condition_1 THEN
    result_1
WHEN condition_2 THEN
    result_2
WHEN condition_3 THEN
    result_3
ELSE
    result_4
END;
```

Traducción de SQL:

Elige los campos name y publisher_id de la tabla books. Si el valor en la columna publisher_id está vacío, reemplázalo con -1. De lo contrario, deja el valor como está. Llama publisher_id_full a la columna resultante.

**EJEMPLO**

```
SELECT
    name,
    CASE WHEN publisher_id IS NULL THEN -1 -- si no se especifica la editorial, 
-- un publisher_id de -1
    ELSE publisher_id END AS publisher_id_full
FROM
    books;
```

## Ejercicios!

**Ejercicio 1**

Busca valores NULL en el campo weight de la tabla products. Imprime los siguientes campos: name,units,weight.

In [ ]:
SELECT
    name,
    units,
    weight 
FROM
    products
where 
    weight is null

**Ejercicio 2**

Encuentra el número de valores NULL en el campo weight de la tabla products.

In [ ]:
SELECT
    count(*)-
FROM
    products
where 
    weight is null

**Ejercicio 3**

Encuentra pesos promedios de los productos, agrupados por unidades de medida (units). Guárdalos en el nuevo campo con el nombre avg_weight. Las columnas deben ir en este orden: avg_weight, units.

In [ ]:
SELECT
    avg(weight::real) as avg_weight ,
    units
FROM
    products
group by 
    units

**Ejercicio 4**

Utiliza una consulta que contenga CASE para reemplazar manualmente NULL con los promedios que calculamos en la tarea anterior en cada grupo de units. Llama el campo resultante weight_full. Los valores de la columna deben ser cadenas e ir en el siguiente orden: name, weight_full.

Necesitarás los resultados del ejercicio anterior:

- 23.0705263269575,oz
- 10.0,ct
- 12.0909090909091,pk
- 0.650793650793651,gal
- 1.0,%
- 1.0,pt
- 1.0,qt

In [ ]:
SELECT

    name,
    CASE WHEN weight IS NULL
        AND units = '%' THEN
        '1.0'
    WHEN weight IS NULL
        AND units = 'pt' THEN
        '1.0'
    WHEN weight IS NULL
        AND units = 'ct' THEN
        '10.0'
    WHEN weight IS NULL
        AND units = 'qt' THEN
        '1.0'
    WHEN weight IS NULL
        AND units = 'gal' THEN
        '0.650793650793651'
    WHEN weight IS NULL
        AND units = 'pk' THEN
        '12.0909090909091'
    WHEN weight IS NULL
        AND units = 'oz' THEN
        '23.0705263269575'
    ELSE
        weight
    END AS weight_full
FROM
    products;

<hr>

## Buscar datos en la tabla

¿qué pasa si el nombre de la marca se indica en la misma columna que el nombre del producto y no hay un campo distinto para él? Tendrás que saber cómo buscar substrings.

El operador LIKE busca en una tabla valores que siguen un patrón dado. Puedes buscar no solo una palabra, sino también un fragmento de ella.

Aquí tienes la sintaxis de las declaraciones LIKE:

```
column_name LIKE 'expresión regular'
```

Indica la columna necesaria antes de LIKE y escribe una expresión regular después.

Estamos buscando libros con la palabra "Vampire" en el título.

Para buscarlos, hay que escribir una expresión regular que incluya la base. Recuerda que una expresión regular o máscara es una plantilla que te permite encontrar una string entera a partir de una substring. Las expresiones regulares consisten en símbolos que representan valores.

Las expresiones regulares en SQL difieren un poco de las que se usan en otros contextos. Por ejemplo, en SQL, el símbolo % representa cualquier número de caracteres.

La expresión regular que necesitamos se ve así: '%Vampire%'. (No olvides que se escribe con una V mayúscula ya que es un título).

Tras formar la expresión regular podemos escribir nuestra consulta:

```
SELECT
    *
FROM
    books
WHERE
    name LIKE '%Vampire%';
```

El operador NOT nos da una consulta "inversa": selecciona todos los libros cuyos nombres no incluyen la palabra "Vampire". Por ejemplo, podemos utilizar el operador NOT con LIKE así:

```
SELECT
    *
FROM
    books
WHERE
    name NOT LIKE '%Vampire%';
```

Pero, ¿qué pasa si buscamos literalmente el símbolo % en un dataset?

En estos casos, utilizamos el operador ESCAPE. Se le pasa un símbolo, como un signo de exclamación, que se convierte en el caracter de escape. Cualquier caracter de escape que se asigne en la expresión regular significa que el símbolo que le sigue no es un carácter comodín, sino el carácter en sí mismo, que debe incluir la substring.

```
column_name LIKE '%!%%' ESCAPE '!'
--busca todas las substrings que incluyan %
```

Ahora vamos a practicar un poco con nuestra base de datos de productos lácteos.

## Ejercicios

**Ejercicio 1**

Aprendimos en la lección anterior que algunos productos tienen unidades de medida peculiares indicadas como porcentajes. Probablemente se ha filtrado un error en nuestros datos. Busca la cadena que tiene % en el campo de unidades. Imprime todas sus filas.

In [ ]:
SELECT
    * 
FROM
    products
WHERE 
    units like '%!%%' escape '!'

**Ejercicio 2**

Encuentra todos los productos cuyos nombres contengan la palabra "Moo". Imprime todos los datos sobre ellos de la tabla products.

In [ ]:
SELECT
    *
FROM
    products
WHERE 
    name like '%Moo%'

**Ejercicio 3**

De los productos cuyos nombres contienen Moo selecciona los de la categoría 'milk'. Encuentra su precio promedio el 1 de junio de 2019, Día Mundial de la Leche. Guarda el resultado en la variable avg_price.

Vamos a revisar los nombres de los campos:

- Nombre del producto: name en la tabla products
- Categoría: category en la tabla products
- Identificador del producto: id_product en la tabla products
- Precio: price en la tabla products_stores
- Fecha: date_upd en la tabla products_stores

In [ ]:
SELECT 
    AVG(ps.price) AS avg_price
FROM
    products_stores ps
WHERE 
    ps.date_upd::date = '2019-06-01'
    AND ps.id_product IN (
        SELECT p.id_product
        FROM products p
        WHERE p.name LIKE '%Moo%' AND p.category = 'milk'
    );

<hr>

## Join. Inner Join.

Hay dos formas de unir tablas: INNER y OUTER JOIN.

**INNER JOIN** devuelve solo aquellas filas que tienen valores coincidentes de una tabla a otra (la intersección de las tablas). **OUTER JOIN** recupera todos los datos de una tabla y agrega datos de la otra cuando hay filas coincidentes. Hay dos tipos de OUTER JOIN, left (izquierda ) y right (derecha)

#### INNER JOIN 

INNER JOIN selecciona solo los datos para los que se cumple la condición de unión. El orden en que se unen las tablas no afecta el resultado final.

Aquí tienes un ejemplo de consulta con INNER JOIN:

```
SELECT --enumerando solo los campos que se necesitan
    TABLE_1.field_1 AS field_1,
    TABLE_1.field_2 AS field_2,
    ...
    TABLE_2.field_n AS field_n
FROM
    TABLE_1
    INNER JOIN TABLE_2 ON TABLE_2.field_1 = TABLE_1.field_2;
```
- INNER JOIN es el nombre del método de unión. Luego viene el nombre de la tabla que se unirá a la tabla del bloque FROM.
- ON precede a la condición de unión: TABLE_2.field_1 = TABLE_1.field_2. Esto significa que solo se unirán las filas de la tabla que cumplan esta condición. En nuestro caso, la condición es que field_1 de la segunda tabla coincida con field_2 de la primera.

Dado que los campos en diferentes tablas pueden tener los mismos nombres, se hace referencia a ellos tanto por el nombre de la tabla como por el nombre del campo. Primero va el nombre de la tabla, después el campo: TABLE_1.field_1.

Vamos a ver cómo funciona INNER JOIN.

Aquí está nuestra primera tabla, animals, que contiene datos sobre animales domésticos. Tiene campos id y name.

|id	|name|
|-|-|
|1|	gato|
|2|	perro|
|3	|hámster|

Y aquí está la segunda tabla, tails, que tiene datos sobre la longitud de las colas de los animales. El campo id de esta tabla es el id del animal.

|id	|tails|
|-|-|
|1	|10|
|2|	5|
|4	|1|

Vamos a aplicar INNER JOIN a tails y animals en el campo id.

|id	|name	|tails|
|-|-|-|
|1	|gato	|10|
|2	|perro|	5|
 

Ahora tenemos una tabla con dos filas. La columna id solo incluye los valores 1 y 2, ya que están presentes en ambas tablas.

El hámster no llegó a la tabla resultante porque su id no coincide con la tabla tails.

Vamos a analizar otro caso. La tabla de animals sigue siendo la misma:

|id|	name|
|-|-|
|1|	gato|
|2|	perro|
|3|hámster|

Pero la tabla tails ahora se ve así:

|id	|tails|
|-|-|
|1	|10|
|1	|15|
|2	|5|
|4	|1|

Vamos a unir los animales a sus nuevas colas. Esta vez, tenemos 3 filas en lugar de 2:

|id	|name|	tails|
|-|-|-|
|1	|gato	|10|
|1	|gato	|15|
|2	|perro	|5|

¿Por qué? El identificador (id) con el valor 1 coincide con dos filas en la tabla tails. Ambos coinciden con la condición de unión por lo que ambos se incluyen en la tabla resultante.

Ten cuidado con esta función de unión de tablas. La duplicación de filas es un error común en las consultas SQL de todos los niveles de complejidad.

Vamos a escribir una consulta que reúna los siguientes campos en una tabla:

- título del libro (name) de la tabla books
- author_id de la tabla books
- author_id de la tabla author
- nombre del autor (first_name) de la tabla author
- apellido del autor (last_name) de la tabla author:

Echa un vistazo a las tres primeras filas

```
SELECT
    books.name AS name,
    books.author_id AS books_author_id,
    author.author_id AS author_id,
    author.first_name AS first_name,
    author.last_name AS last_name
FROM
    books
    INNER JOIN author ON author.author_id = books.author_id
LIMIT 3;
```

|name|	books_author_id|	id_autor|	first_name|	last_name|
|-|-|-|-|-|
|La Ciudad de Los Espejos	|3|	3	|Justin	|Cronin|
|El país de octubre|	5|5	|Ray	|Bradbury|
|Saint Odd	|7	|7	|Dean|	Koontz|

En la tabla resultante, los valores del campo author_id de la tabla books y los del author_id de la tabla author son los mismos. Para evitar duplicaciones innecesarias, vamos a mostrar solo una de estas columnas. Vamos a tomar author_id de la tabla books:

```
SELECT
    books.name AS name,
    books.author_id AS books_author_id,
    author.first_name AS first_name,
    author.last_name AS last_name
FROM
    books
    INNER JOIN author ON author.author_id = books.author_id
LIMIT 3;
```

|name|	books_author_id|	first_name|	last_name|
|-|-|-|-|
|La Ciudad de Los Espejos|	3	|Justin|	Cronin|
|El país de octubre|	5	|Ray	|Bradbury|
|Saint Odd|	7	|Dean|	Koontz|

Al unir tablas puedes especificar condiciones en el bloque WHERE. Por ejemplo, vamos a recuperar solo libros de Dean Koontz:

```
SELECT
    books.name AS name,
    author.first_name AS first_name,
    author.last_name AS last_name
FROM
    books
    INNER JOIN author ON author.author_id = books.author_id
WHERE
    author.first_name = 'Dean'
    AND author.last_name = 'Koontz';
```

|name	|first_name|	last_name|
|-|-|-|
|Saint Odd	|Dean	|Koontz|
|Mirada ciega	|Dean	|Koontz|
|Lightning|	Dean|	Koontz|
|Intensidad|	Dean	|Koontz|

Ahora vamos a practicar un poco con nuestra base de datos de productos lácteos. Aquí está el diagrama ER como referencia.

## Ejercicios!

**Ejercicio 1**

Escribe una consulta para recuperar:

- Números de transacciones: id_transaction de la tabla transactions
- Nombres de categoría: category de la tabla products
- Nombres de productos: name de la tabla products

La condición de unión es que los valores de los campos products.id_product y transactions.id_product sean iguales. Los nombres de los campos en la tabla resultante son id_transaction, category y name.

Imprime 10 filas. Ordena los datos en orden ascendente por número de transacción.

In [ ]:
SELECT 
    transactions.id_transaction as id_transaction,
    products.category as category,
    products.name as name
FROM
    transactions
    INNER JOIN products ON products.id_product = transactions.id_product
ORDER BY 
    id_transaction
LIMIT 10

**Ejercicio 2**

Los datos sobre las ventas y el clima se almacenan en diferentes tablas. En este caso nos ayudará INNER JOIN.

Para cada transacción, recupera los siguientes datos:

- El día y la hora de la transacción (date) de la tabla de transactions.
- Temperatura del aire (temp) de la tabla weather
- Información sobre la lluvia (rain) de la tabla weather
- El identificador de la transacción (id_transaction) de la tabla transactions

En la nueva tabla asigna a los campos los nombres date, temp, rain e id_transaction e imprímelos.

Ordena los datos en orden descendente por fecha de compra.

In [ ]:
SELECT DISTINCT
    transactions.date AS date,
    weather.temp AS temp,
    weather.rain AS rain,
    transactions.id_transaction AS id_transaction
FROM
    transactions
    INNER JOIN weather ON CAST(weather.date AS date) = CAST(transactions.date AS date)
ORDER BY
    date DESC;

**Ejercicio 3**

Escribe una consulta para imprimir diferentes productos con precios (price) superiores a $5.

Selecciona diferentes nombres de productos (name) de la tabla products. Llama al campo resultante name y muéstralo.

Une los datos de la tabla products_stores a products utilizando el método INNER JOIN en el campo id_product.

In [ ]:
SELECT distinct
	products.name as name
FROM
    products
    INNER JOIN products_stores ON products_stores.id_product =products.id_product
WHERE 
    products_stores.price > 5

**Ejercicio 4**

Recupera transacciones (compras) de productos de la categoría 'butter' en un día: 20 de junio de 2019.

Selecciona los siguientes datos de las tablas transactions y products:

- El día y la hora (date) de la tabla de transactions.
- Número de transacción: id_transaction de la tabla transactions
- Nombre de la categoría: category de la tabla products
- Nombre del producto: name de la tabla products

Une los datos de la tabla products con transactions utilizando el método INNER JOIN en el campo id_product.

En la nueva tabla asigna a los campos los nombres date, id_transaction, category, name y muéstralos.

In [ ]:
SELECT 
    transactions.date AS date,
    transactions.id_transaction AS id_transaction,
    products.category AS category,
    products.name AS name
FROM
    transactions
    INNER JOIN products ON transactions.id_product = products.id_product
WHERE 
    products.category = 'butter' AND transactions.date::date = '2019-06-20';

**Ejercicio 5**

Imprime los precios de los productos cuyos pesos se miden en onzas ('oz') para el 13 de junio de 2019.

Recupera:

- nombre del producto: name de la tabla products

- categoría: category de la tabla products

- unidades de medida: units de la tabla de products

- peso: weight de la tabla products

- precio: price de la tabla products_stores

Une las tablas products_stores y products usando el método INNER JOIN en el campo id_product.

Utiliza los siguientes nombres para lo que vas a recuperar: name, category, units, weight y price.

In [ ]:
SELECT 
    products.name AS name,
    products.category AS category,
    products.units AS units,
    products.weight AS weight,
    products_stores.price AS price
FROM
    products
INNER JOIN products_stores ON products.id_product = products_stores.id_product
WHERE 
    products.units = 'oz' AND products_stores.date_upd::date = '2019-06-13';

<hr>

## Outer Join . Left Join

Existen dos tipos de OUTER JOIN:

- LEFT OUTER JOIN
- RIGHT OUTER JOIN

Vamos a dar a estos métodos nombres cortos: LEFT JOIN y RIGHT JOIN.

LEFT JOIN seleccionará todos los datos de la tabla de la izquierda junto con las filas de la tabla de la derecha que cumplen con la condición de unión. RIGHT JOIN hará lo mismo, pero para la tabla de la derecha.

Aquí está la sintaxis de una declaración con LEFT JOIN:

```
SELECT
    TABLE_1.field_1 AS field_1,
    TABLE_1.field_2 AS field_2,
    ...
    TABLE_2.field_n AS field_n
FROM
    TABLE_1
    LEFT JOIN TABLE_2 ON TABLE_2.field = TABLE_1.field;
```


Al igual que con las consultas INNER JOIN, el nombre de la tabla se indica para cada campo. Ten en cuenta que con OUTER JOIN, el orden en que se mencionan las tablas tiene importancia. En este ejemplo, TABLE_1 es la tabla de la izquierda.

Vamos a volver a animals y tails y unirlas por id usando LEFT JOIN.

|id	|name|
|-|-|
|1|	gato|
|2	|perro|
|3	|hámster|


|id	|tail|
|-|-|
|1	|10|
|2	|5|
|4	|1|

Aquí tienes el resultado de LEFT JOIN:

|id|	nam|	tail|
|-|-|-|
1	|gato|	10|
2	|perro	|5|
3	|hámster|	NULL|

## Ejercicios!

**Ejercicio 1**

Escribe una consulta para seleccionar unívocos (distinct):

- id_product de la tabla products
- name de la tabla products
- id_store de la tabla products_stores

Adjunta la tabla products_stores a la tabla products utilizando el método LEFT JOIN por el campo id_product.
Selecciona solo aquellas filas donde el valor id_store sea NULL. Si no existen tales filas, entonces sabemos que todos los productos están en venta en al menos un lugar.

Llama a los campos de la tabla resultante id_product, name y id_store

In [ ]:
SELECT DISTINCT
    products.id_product AS id_product,
    products.name AS name,
    products_stores.id_store AS id_store
FROM
    products
LEFT JOIN products_stores ON products_stores.id_product = products.id_product
WHERE
    products_stores.id_store IS NULL;

**Ejercicio 2**

Como proveedor puedes ofrecer a las tiendas productos que no están vendiendo actualmente.

Imprime los nombres únicos de productos que nunca se han vendido en la tienda (id_store) cuyo identificador único es 3. 

1) Selecciona los nombres de productos únicos name de la tabla products. Guárdalos en la variable name.

2)  Utilizando LEFT JOIN, une la consulta externa con la subconsulta subquery por el campo id_product. Dentro de la subconsulta selecciona los id_product únicos de la tabla transactions donde el valor de id_store es 3.

In [ ]:
SELECT DISTINCT p.name
FROM products p
LEFT JOIN (
    SELECT DISTINCT id_product
    FROM transactions
    WHERE id_store = 3
) AS subquery ON subquery.id_product = p.id_product
WHERE subquery.id_product IS NULL;

**Ejercicio 3**

Escribe los nombres de los productos que no se estaban vendiendo en ninguna tienda el 11 de junio de 2019.

1) Selecciona los nombres de productos únicos name de la tabla products. Guárdalos en la variable name.

2) Utilizando LEFT JOIN, une la consulta externa con la subconsulta por el campo id_product. En la subconsulta, selecciona id_product y id_store para el 11 de junio de 2019.

In [ ]:
SELECT DISTINCT p.name
FROM products p
LEFT JOIN (
    SELECT DISTINCT id_product, id_store
    FROM transactions
    WHERE CAST(date AS date) = '2019-06-11'
) AS subquery ON subquery.id_product = p.id_product
WHERE subquery.id_product IS NULL;

<hr>

## Outer right join

**Ejercicio 1**

Utiliza el método RIGHT JOIN para imprimir las fechas que no tienen entradas de transacciones pero tienen datos sobre el tiempo:

1) Recupera la fecha (date) de la tabla weather. Ten en cuenta que debe convertirse al tipo de datos correcto con CAST.

2) Une la tabla weather a la tabla transactions con el RIGHT JOIN por el campo date.

3) Haz un slice de datos en el bloque WHERE: selecciona solo las fechas vacías de la tabla transactions con la ayuda de IS NULL.

4) Imprime el campo date de la tabla resultante.

In [ ]:
SELECT
    cast(weather.date AS date) AS date
FROM
    transactions
    RIGHT JOIN weather ON cast(weather.date AS date) = cast(transactions.date AS date)
WHERE
    transactions.date IS NULL;

**Ejercicio 2**

Cualquier consulta con LEFT JOIN puede ser escrita como RIGHT JOIN y al revés. Completa el ejercicio de la lección anterior con el método RIGHT JOIN.

Imprime los nombres únicos de los productos que nunca se han vendido en la tienda cuyo identificador único es 3.

1) Selecciona los nombres de productos únicos name de la tabla products. Guárdalos en la variable name.

2) Utilizando RIGHT JOIN, une la subquery con la consulta externa por el campo id_product. Dentro de la subconsulta selecciona los productos únicos id_product de la tabla transactions donde el valor de id_store es 3. 

3) En el bloque WHERE de la consulta externa, busca los valores NULL en id_product en la tabla subquery.

In [ ]:
SELECT 
    products.name AS name
FROM 
    (SELECT DISTINCT id_product
     FROM transactions
     WHERE id_store = 3) AS subquery
RIGHT JOIN products ON subquery.id_product = products.id_product
WHERE 
    subquery.id_product IS NULL;